app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(school_class_params)

    respond_to do |format|
      if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-10-16 18:55:39.694212"], ["updated_at", "2017-10-16 18:55:39.694212"]]

  def update
    respond_to do |format|
      if @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-10-16 18:55:41.786399"], ["id", 1]]